// File: src/pages/PrivacyPolicy.js

import React from 'react';
import '../assets/css/Policy.css';

function PrivacyPolicy() {
  return (
    <div className="policy-page">
      <div className="policy-content">
        <h1>Політика конфіденційності</h1>
        <p>
          Ми дбаємо про вашу конфіденційність і прагнемо захищати ваші персональні дані. Ця політика конфіденційності пояснює, яку інформацію ми збираємо, як ми її використовуємо та захищаємо.
        </p>
        <h2>Збір інформації</h2>
        <p>
          Ми можемо збирати інформацію про вас, коли ви використовуєте наш веб-сайт, реєструєтеся на ньому, або взаємодієте з нами іншим чином. Це може включати ваше ім'я, адресу електронної пошти, телефонний номер та інші контактні дані.
        </p>
        <h2>Використання інформації</h2>
        <p>
          Ми використовуємо зібрану інформацію для надання послуг, покращення нашого веб-сайту, а також для зв'язку з вами щодо вашого користувацького досвіду. Ми не передаємо ваші дані третім особам без вашої згоди.
        </p>
        <h2>Захист інформації</h2>
        <p>
          Ми використовуємо сучасні засоби захисту для забезпечення безпеки ваших персональних даних. Ваші дані захищені від несанкціонованого доступу, розголошення та зміни.
        </p>
        <h2>Зміни до політики конфіденційності</h2>
        <p>
          Ми можемо оновлювати цю політику конфіденційності час від часу. Усі зміни будуть опубліковані на цій сторінці. Рекомендуємо вам періодично перевіряти цю сторінку на предмет оновлень.
        </p>
        <p>
          Якщо у вас є питання або зауваження щодо нашої політики конфіденційності, будь ласка, зв'яжіться з нами.
        </p>
      </div>
    </div>
  );
}

export default PrivacyPolicy;
