// File: src/pages/TermsOfService.js

import React from 'react';
import '../assets/css/Policy.css';

function TermsOfService() {
  return (
    <div className="policy-page">
      <div className="policy-content">
        <h1>Умови користування</h1>
        <p>
          Ласкаво просимо на наш веб-сайт. Користуючись нашим сайтом, ви погоджуєтесь дотримуватися наступних умов користування. Будь ласка, уважно прочитайте ці умови перед тим, як почати користуватися нашим сайтом.
        </p>
        <h2>Використання сайту</h2>
        <p>
          Ви погоджуєтесь використовувати наш сайт тільки в законних цілях і в спосіб, який не порушує права інших осіб і не обмежує або не заважає їх використанню сайту.
        </p>
        <h2>Контент сайту</h2>
        <p>
          Весь контент, представлений на сайті, включаючи текст, графіку, логотипи, іконки, зображення та програмне забезпечення, є власністю нашої компанії або наших постачальників контенту і захищений законами про авторське право.
        </p>
        <h2>Зміни до умов</h2>
        <p>
          Ми залишаємо за собою право вносити зміни до цих умов у будь-який час. Ви повинні періодично перевіряти цю сторінку на предмет змін. Продовжуючи користуватися сайтом після публікації змін, ви погоджуєтесь дотримуватися нових умов.
        </p>
        <h2>Зв'язок з нами</h2>
        <p>
          Якщо у вас є питання або зауваження щодо цих умов користування, будь ласка, зв'яжіться з нами.
        </p>
      </div>
    </div>
  );
}

export default TermsOfService;
